In [58]:
# Load the sql extension
%load_ext sql
# Connect to the MySQL database
%sql mysql://root:mysql12345@localhost:3306/HR

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

# Using Views

In [59]:
%%sql
# create VIEW
CREATE OR REPLACE VIEW EMPSALARY  AS 
SELECT EMP_ID, F_NAME, L_NAME, B_DATE, SEX, JOB_TITLE, MIN_SALARY, MAX_SALARY
FROM EMPLOYEES, JOBS
WHERE EMPLOYEES.JOB_ID = JOBS.JOB_IDENT;

 * mysql://root:***@localhost:3306/HR
0 rows affected.

[]

In [23]:
%%sql
# SELECT * FROM EMPLOYEES;
SELECT * FROM JOBS;

 * mysql://root:***@localhost:3306/HR
10 rows affected.

[('100', 'Sr. Architect', Decimal('60000.00'), Decimal('100000.00')),
 ('200', 'Sr.Software Developer', Decimal('60000.00'), Decimal('80000.00')),
 ('220', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00')),
 ('234', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00')),
 ('300', 'Jr.Software Developer', Decimal('40000.00'), Decimal('60000.00')),
 ('400', 'Jr.Software Developer', Decimal('40000.00'), Decimal('60000.00')),
 ('500', 'Jr. Architect', Decimal('50000.00'), Decimal('70000.00')),
 ('600', 'Lead Architect', Decimal('70000.00'), Decimal('100000.00')),
 ('650', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00')),
 ('660', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00'))]

In [24]:
%%sql
SELECT * FROM EMPSALARY

 * mysql://root:***@localhost:3306/HR
10 rows affected.

[('E1001', 'John', 'Thomas', datetime.date(2001, 5, 12), 'M', 'Sr. Architect', Decimal('60000.00'), Decimal('100000.00')),
 ('E1002', 'Alice', 'James', datetime.date(1998, 9, 22), 'F', 'Sr.Software Developer', Decimal('60000.00'), Decimal('80000.00')),
 ('E1003', 'Steve', 'Wells', datetime.date(2005, 12, 5), 'M', 'Jr.Software Developer', Decimal('40000.00'), Decimal('60000.00')),
 ('E1004', 'Santosh', 'Kumar', datetime.date(1994, 6, 19), 'M', 'Jr.Software Developer', Decimal('40000.00'), Decimal('60000.00')),
 ('E1005', 'Ahmed', 'Hussain', datetime.date(2000, 1, 10), 'M', 'Jr. Architect', Decimal('50000.00'), Decimal('70000.00')),
 ('E1006', 'Nancy', 'Allen', datetime.date(1999, 11, 28), 'F', 'Lead Architect', Decimal('70000.00'), Decimal('100000.00')),
 ('E1007', 'Mary', 'Thomas', datetime.date(2002, 7, 14), 'F', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00')),
 ('E1008', 'Bharath', 'Gupta', datetime.date(1996, 3, 1), 'M', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00')),
 ('E1009', 'Andrea', 'Jones', datetime.date(2003, 10, 9), 'F', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00')),
 ('E1010', 'Ann', 'Jacob', datetime.date(1997, 2, 16), 'F', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00'))]

In [25]:
%%sql
DROP VIEW EMPSALARY;

 * mysql://root:***@localhost:3306/HR
0 rows affected.

[]

In [26]:
%%sql
SELECT * FROM EMPSALARY

 * mysql://root:***@localhost:3306/HR
(MySQLdb.ProgrammingError) (1146, "Table 'hr.empsalary' doesn't exist")
[SQL: SELECT * FROM EMPSALARY]
(Background on this error at: https://sqlalche.me/e/20/f405)

# JOINS

1. Select the names and job start dates of all employees who work for the department number 5.

In [63]:
%%sql
SELECT E.F_NAME, E.L_NAME, JH.START_DATE, E.DEP_ID
FROM EMPLOYEES AS E
INNER JOIN JOB_HISTORY AS JH ON E.EMP_ID = JH.EMPL_ID
WHERE E.DEP_ID = '5';

 * mysql://root:***@localhost:3306/HR
4 rows affected.

[('Alice', 'James', datetime.date(2001, 8, 1), '5'),
 ('Steve', 'Wells', datetime.date(2001, 8, 16), '5'),
 ('Santosh', 'Kumar', datetime.date(2000, 8, 16), '5'),
 ('Ann', 'Jacob', datetime.date(2016, 8, 16), '5')]

2. Select the names, job start dates, and job titles of all employees who work for the department number 5.

In [64]:
%%sql
SELECT E.F_NAME, E.L_NAME, J.JOB_TITLE, E.DEP_ID
FROM EMPLOYEES AS E
INNER JOIN JOBS AS J ON E.JOB_ID = J.JOB_IDENT
WHERE E.DEP_ID = '5';

 * mysql://root:***@localhost:3306/HR
4 rows affected.

[('Alice', 'James', 'Sr.Software Developer', '5'),
 ('Steve', 'Wells', 'Jr.Software Developer', '5'),
 ('Santosh', 'Kumar', 'Jr.Software Developer', '5'),
 ('Ann', 'Jacob', 'Sr. Designer', '5')]

3. Perform a Left Outer Join on the EMPLOYEES and DEPARTMENT tables and select employee id, last name, department id and department name for all employees.

In [65]:
%%sql
select E.EMP_ID,E.L_NAME,E.DEP_ID,D.DEP_NAME
from EMPLOYEES AS E 
LEFT OUTER JOIN DEPARTMENTS AS D ON E.DEP_ID=D.DEPT_ID_DEP;

 * mysql://root:***@localhost:3306/HR
10 rows affected.

[('E1001', 'Thomas', '2', 'Architect Group'),
 ('E1002', 'James', '5', 'Software Group'),
 ('E1003', 'Wells', '5', 'Software Group'),
 ('E1004', 'Kumar', '5', 'Software Group'),
 ('E1005', 'Hussain', '2', 'Architect Group'),
 ('E1006', 'Allen', '2', 'Architect Group'),
 ('E1007', 'Thomas', '7', 'Design Team'),
 ('E1008', 'Gupta', '7', 'Design Team'),
 ('E1009', 'Jones', '7', 'Design Team'),
 ('E1010', 'Jacob', '5', 'Software Group')]

4. Re-write the previous query but limit the result set to include only the rows for employees born before 2000.

In [71]:
%%sql
select E.EMP_ID,E.L_NAME,E.DEP_ID,D.DEP_NAME, E.B_DATE
from EMPLOYEES AS E 
LEFT OUTER JOIN DEPARTMENTS AS D ON E.DEP_ID=D.DEPT_ID_DEP 
where YEAR(E.B_DATE) < 2000;

 * mysql://root:***@localhost:3306/HR
5 rows affected.

[('E1002', 'James', '5', 'Software Group', datetime.date(1998, 9, 22)),
 ('E1004', 'Kumar', '5', 'Software Group', datetime.date(1994, 6, 19)),
 ('E1006', 'Allen', '2', 'Architect Group', datetime.date(1999, 11, 28)),
 ('E1008', 'Gupta', '7', 'Design Team', datetime.date(1996, 3, 1)),
 ('E1010', 'Jacob', '5', 'Software Group', datetime.date(1997, 2, 16))]

5. Re-write the previous query but have the result set include all the employees but department names for only the employees who were born before 1980.

In [72]:
%%sql
select E.EMP_ID,E.L_NAME,E.DEP_ID,D.DEP_NAME
from EMPLOYEES AS E 
LEFT OUTER JOIN DEPARTMENTS AS D ON E.DEP_ID = D.DEPT_ID_DEP 
AND YEAR(E.B_DATE) < 2000;

 * mysql://root:***@localhost:3306/HR
10 rows affected.

[('E1001', 'Thomas', '2', None),
 ('E1002', 'James', '5', 'Software Group'),
 ('E1003', 'Wells', '5', None),
 ('E1004', 'Kumar', '5', 'Software Group'),
 ('E1005', 'Hussain', '2', None),
 ('E1006', 'Allen', '2', 'Architect Group'),
 ('E1007', 'Thomas', '7', None),
 ('E1008', 'Gupta', '7', 'Design Team'),
 ('E1009', 'Jones', '7', None),
 ('E1010', 'Jacob', '5', 'Software Group')]

6. Perform a Full Join on the EMPLOYEES and DEPARTMENT tables and select the First name, Last name and Department name of all employees.

In [77]:
%%sql
# MySQL does not support FULL OUTER JOIN, 
# using a combination of LEFT OUTER JOIN and RIGHT OUTER JOIN with the UNION operator.
# SELECT E.F_NAME, E.L_NAME, D.DEP_NAME
# FROM EMPLOYEES AS E 
# OUTER JOIN DEPARTMENTS AS D ON E.DEP_ID = D.DEPT_ID_DEP;
SELECT E.F_NAME, E.L_NAME, D.DEP_NAME
FROM EMPLOYEES AS E 
LEFT OUTER JOIN DEPARTMENTS AS D ON E.DEP_ID = D.DEPT_ID_DEP
UNION
SELECT E.F_NAME, E.L_NAME, D.DEP_NAME
FROM EMPLOYEES AS E 
RIGHT OUTER JOIN DEPARTMENTS AS D ON E.DEP_ID = D.DEPT_ID_DEP
WHERE E.DEP_ID IS NULL;

 * mysql://root:***@localhost:3306/HR
10 rows affected.

[('John', 'Thomas', 'Architect Group'),
 ('Alice', 'James', 'Software Group'),
 ('Steve', 'Wells', 'Software Group'),
 ('Santosh', 'Kumar', 'Software Group'),
 ('Ahmed', 'Hussain', 'Architect Group'),
 ('Nancy', 'Allen', 'Architect Group'),
 ('Mary', 'Thomas', 'Design Team'),
 ('Bharath', 'Gupta', 'Design Team'),
 ('Andrea', 'Jones', 'Design Team'),
 ('Ann', 'Jacob', 'Software Group')]

7. Re-write the previous query but have the result set include all employee names but department id and department names only for male employees.

In [81]:
%%sql
# select E.F_NAME,E.L_NAME,D.DEPT_ID_DEP, D.DEP_NAME
# from EMPLOYEES AS E 
# FULL OUTER JOIN DEPARTMENTS AS D ON E.DEP_ID=D.DEPT_ID_DEP AND E.SEX = 'M';
SELECT E.F_NAME, E.L_NAME, D.DEPT_ID_DEP, D.DEP_NAME
FROM EMPLOYEES AS E 
LEFT OUTER JOIN DEPARTMENTS AS D ON E.DEP_ID = D.DEPT_ID_DEP AND E.SEX = 'M'
UNION
SELECT E.F_NAME, E.L_NAME, D.DEPT_ID_DEP, D.DEP_NAME
FROM EMPLOYEES AS E 
RIGHT OUTER JOIN DEPARTMENTS AS D ON E.DEP_ID = D.DEPT_ID_DEP AND E.SEX = 'M'
WHERE E.DEP_ID IS NULL;

 * mysql://root:***@localhost:3306/HR
10 rows affected.

[('John', 'Thomas', '2', 'Architect Group'),
 ('Alice', 'James', None, None),
 ('Steve', 'Wells', '5', 'Software Group'),
 ('Santosh', 'Kumar', '5', 'Software Group'),
 ('Ahmed', 'Hussain', '2', 'Architect Group'),
 ('Nancy', 'Allen', None, None),
 ('Mary', 'Thomas', None, None),
 ('Bharath', 'Gupta', '7', 'Design Team'),
 ('Andrea', 'Jones', None, None),
 ('Ann', 'Jacob', None, None)]